{"config": [{"config": {"consume_less": "cpu", "return_sequences": true, "batch_input_shape": [1, 1, 429], "forget_bias_init": "one", "name": "lstm_3", "b_regularizer": null, "U_regularizer": null, "inner_init": "orthogonal", "dropout_W": 0.0, "go_backwards": false, "trainable": true, "dropout_U": 0.0, "W_regularizer": null, "activation": "tanh", "unroll": false, "stateful": true, "init": "glorot_uniform", "inner_activation": "hard_sigmoid", "input_dtype": "float32", "output_dim": 256}, "class_name": "LSTM"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"consume_less": "cpu", "return_sequences": true, "batch_input_shape": [1, 1, 256], "forget_bias_init": "one", "name": "lstm_4", "b_regularizer": null, "U_regularizer": null, "inner_init": "orthogonal", "dropout_W": 0.0, "go_backwards": false, "trainable": true, "output_dim": 256, "W_regularizer": null, "activation": "tanh", "unroll": false, "stateful": true, "init": "glorot_uniform", "inner_activation": "hard_sigmoid", "dropout_U": 0.0}, "class_name": "LSTM"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "timedistributed_2", "layer": {"config": {"bias": true, "name": "dense_2", "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "input_dim": null, "output_dim": 429, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}, {"config": {"trainable": true, "name": "activation_2", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.1"}